{
  "General Information": {
    "Name": "Joseph (Joey) Headley",
    "Job Title": "Data Analyst",
    "Citizenship": "USA"
  },
  "skills": [
    {
      "name": "Programming Languages",
      "icon": "fa-solid fa-code",
      "keywords": [
        "SQL (PostgreSQL & PostGIS)",
        "Python",
        "R",
        "JavaScript",
        "Bash"
      ]
    },
    {
      "name": "Software",
      "icon": "fa-solid fa-computer",
      "keywords": [
        "Tableau",
        "Power BI",
        "ArcGIS Pro",
        "Git/GitHub",
        "RStudio"
      ]
    }
  ],
  "work": [
    {
      "name": "City of Boston Citywide Analytics Team",
      "position": "Data Analyst",
      "url": "https://www.boston.gov/departments/analytics-team/joey-headley",
      "location": "Boston, MA",
      "startDate": "2021-10-18",
      "endDate": "Present",
      "summary": "Work with departments across the City to use data to answer important operational questions, provide impactful analyses of services, and create useful business tools such as dashboards and maps.",
      "highlights": ["Informed decision on hiring of BPS superintendent by identifying most desired candidate qualities from collected survey responses through the use of spaCy and various unsupervised clustering algorithms.", "Assisted Property Management Department in reducing BOS311 graffiti case backlog by 34% in 2 months by developing prioritization score using Arcpy to more efficiently select cases to address.", "Helped inform $4B in City Council budgetary allocations for FY24 and FY25 by working across team verticals to build the Employee Demographics Dashboard, which provided essential demographic statistics about City employees.", "Recreated the Rentsmart Dashboard, in Power BI with improved efficiency, data structure, and visual design to better enable the public to make more informed rental decisions.", "Completed numerous ad hoc data requests for stakeholders such as analyzing the effect of IPS permit process improvement on permit approval times and visualizing fire related data submitted to CAD from a timespan starting the week before and ending the week after the 4th of July over the past 6 years.", "Collaborated across different team verticals in large scale projects like the City Metric Library and transitioning from Tableau to Power BI.", "Maintained and updated Knack apps used by various departments across the City."]
    }, 
    {
      "name": "City of Boston Citywide Analytics Team",
      "position": "Data Analyst Intern",
      "url": "https://www.boston.gov/news/fellow-full-time-joseph-headley",
      "startDate": "2021-06-14",
      "endDate": "2021-08-20",
      "summary": "Focused on rebuilding the Rentsmart webpage, formerly hosted on Heroku, as a dashboard published to the City’s Tableau Server as well as short-term ad-hoc analysis and dashboarding requests.",
      "highlights": ["Supported the design, development, implementation, and maintenance of the Tableau version of the RentSmart dashboard, City Score pothole repair analysis, and Open Data Submission dashboard.", "Worked with the team’s data engineers to automate data refresh for the RentSmart dashboard.", "Assembled, manipulated and formatted data using various software applications such as desktop tools, spreadsheets, statistical software, and graphical presentation tools, specifically SQL and Tableau."]
    },
    {
      "name": "Giving Map",
      "position": "Data Science Intern",
      "url": "https://www.boston.gov/news/fellow-full-time-joseph-headley",
      "startDate": "2020-12-28",
      "endDate": "2021-01-22",
      "summary": "Focused on scrapping the Bureau of Labor Statistics website for county level unemployment data to use to create a time-lapse map of how unemployment changed from the pre-Covid to post-Covid economy.",
      "highlights": ["Searched for, compiled, and detailed important features (ie. accuracy, update frequency, etc.) of various unemployment and poverty data sources in an Excel Spreadsheet.", "Created a FAQ document using HTML, CSS, and Javascript on data from the Bureau of Labor Statistics (BLS) data that we plan to incorporate into an Economic Hardship Map", "Created a Python script that incorporates an SQLite database to acquire unemployment data from the BLS API as a static .csv file", "Used acquired BLS unemployment data to create multiple monthly choropleth maps and, subsequently, one time-lapse map of U.S. unemployment rates from Jan. 2019 to Nov. 2020", "Attended Scrum meetings three times a week to discuss current progress with executive leadership and wrote weekly reports in LaTeX detailing my work for the week as well as potential future work"]
    }
  ],
  "education": [
    {
      "institution": "Williams College",
      "location": "Williamstown, MA",
      "area": "Physics",
      "studyType": "Bachelor of Arts",
      "startDate": "2017-09-01",
      "endDate": "2021-05-31"
    },
    {
      "institution": "The Brooklyn Latin School",
      "location": "Brooklyn, NY",
      "area": "Physics",
      "studyType": "IB Diploma",
      "startDate": "2013-09-01",
      "endDate": "2017-05-31"
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker",
      "icon": "fa-solid fa-language"
    },
    {
      "language": "French",
      "fluency": "B1",
      "icon": "fa-solid fa-language"
    },
    {
      "language": "Japanese",
      "fluency": "N4",
      "icon": "fa-solid fa-language"
    }
  ],
  "interests": [
    {
      "name": "Data Science/Data Analysis",
      "icon": "fa-solid fa-database",
      "keywords": [
        "Natural Language Processing",
        "Machine Learning",
        "Dashboards",
        "Maps"
      ]
    }
  ],
  "projects": [
    {
      "name": "Yelp Data Subset Recommender System",
      "summary": "Created an R Shiny web application that incorporates a combination of NLP Sentiment Analysis and a User Based Collaborative Filtering Recommender System to allow users to make reviews and ratings for Yelp businesses in a data subset in order to receive recommendations based on their own preferences.",
      "highlights": ["Natural Language Processing", "Recommender Systems", "R Shiny"],
      "startDate": "2021-05-20",
      "endDate": "2021-05-27",
      "url": "https://josephheadley.shinyapps.io/deliverables/"
    }
  ]
}
